html/docker/kubernates-handbook/theory/service/toplogy.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>拓扑感知路由</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="../../css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="service.html"> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content">
<h1 class="title">拓扑感知路由</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org016b1a8">先决条件</a></li>
<li><a href="#orgc4274e9">端点切片</a></li>
<li><a href="#org5eca727">启用拓扑感知</a></li>
<li><a href="#org967bd31">管理</a></li>
</ul>
</div>
</div>
<p>
<span class="underline">拓扑感知路</span> 由指的是客户端对一个服务的访问流量，可以根据这个服务的 <span class="underline">端点拓扑</span> ， <b>优先路由</b> 到与该客户端在 <span class="underline">同一个节点</span> 或者 <span class="underline">可用区的端点</span> 上的路由行为
</p>

<div id="outline-container-org016b1a8" class="outline-2">
<h2 id="org016b1a8">先决条件</h2>
<div class="outline-text-2" id="text-org016b1a8">
<p>
为了开启服务感知路由，需要：
</p>
<ul class="org-ul">
<li>开启 <span class="underline">TopologyAwareHints</span> 智能感知提示门控</li>
<li>开启 <span class="underline">EndpointSlice</span> 控制器</li>
<li>安装 <span class="underline">kube-proxy</span></li>
</ul>
</div>
</div>

<div id="outline-container-orgc4274e9" class="outline-2">
<h2 id="orgc4274e9">端点切片</h2>
<div class="outline-text-2" id="text-orgc4274e9">
<pre class="example" id="org754c30a">
Endpoint 通常情况下是由 Service 资源自动创建和管理的，但是随着 Kubernetes 集群的规模越来越大和管理的服务越来越多，Endpoint API 的局限性变得越来越明显
</pre>

<p>
<b>端点切片</b> <span class="underline">EndpointSlices</span> 提供了一种简单的方法来跟踪 Kubernetes 集群中的网络端点。它们为 Endpoint 提供了一种可伸缩和可拓展的替代方案，同时还可以被用到拓扑感知路由中。EndpointSlices 示例如下：
</p>

<pre class="example" id="orgcf0bce7">
apiVersion: discovery.k8s.io/v1
kind: EndpointSlice
metadata:
  name: example-hints
    labels:
	kubernetes.io/service-name: example-svc
addressType: IPv4
ports:
  - name: http
  protocol: TCP
  port: 80
  endpoints:
    - addresses:
	- "10.127.2.3"
      conditions:
	ready: true
      hostname: pod-1
      nodename: node-a
      zone: zone-a
</pre>
<p>
EndpointSlice 中的每个端点都可以包含一定的拓扑信息。 拓扑信息包括 <span class="underline">端点的位置</span> ， <span class="underline">对应节点</span> 、 <span class="underline">可用区</span> 的信息。 这些信息体现为 EndpointSlices 的如下端点字段：
</p>
<ul class="org-ul">
<li>nodeName: 端点所在的 Node 名称</li>
<li>zone: 端点所处的可用区</li>
<li>hostname: 端点的 pod 名称</li>
</ul>
</div>
</div>
<div id="outline-container-org5eca727" class="outline-2">
<h2 id="org5eca727">启用拓扑感知</h2>
<div class="outline-text-2" id="text-org5eca727">
<pre class="example" id="orgace6f93">
请参考启用拓扑感知提示开启此功能

请启用 kube-apiserver、kube-controller-manager、和 kube-proxy 的特性门控 TopologyAwareHints
</pre>
<p>
通过把 Service 中的注解 <span class="underline">service.kubernetes.io/topology-aware-hints</span> 的值设置为 <span class="underline">auto</span> ， 来激活服务的拓扑感知提示功能
</p>
<pre class="example" id="org28b9d11">
这告诉 EndpointSlice 控制器在它认为安全的时候来设置拓扑提示

kube-proxy 组件依据 EndpointSlice 控制器设置的提示，过滤由它负责路由的端点
</pre>

<p>
由 EndpointSlice 控制器提供提示信息后 EndpointSlice 的示例如下：
</p>

<pre class="example" id="org5b57fa4">
apiVersion: discovery.k8s.io/v1
kind: EndpointSlice
metadata:
  name: example-hints
    labels:
      kubernetes.io/service-name: example-svc
addressType: IPv4
ports:
  - name: http
  protocol: TCP
  port: 80
  endpoints:
    - addresses:
	- "10.127.2.3"
      conditions:
	ready: true
      hostname: pod-1
      nodename: node-a
      zone: zone-a
      hints:
	forZones:
	  - name: "zone-a"
</pre>

<p>
看到其中已注入了 hints 信息，对于上面这个示例，zone-a 的客户端访问会优先路由到该端点上
</p>
</div>
</div>

<div id="outline-container-org967bd31" class="outline-2">
<h2 id="org967bd31">管理</h2>
<div class="outline-text-2" id="text-org967bd31">
<p>
在大多数场合下，EndpointSlice 都由某个 Service 所有，因为端点切片正是为该服务跟踪记录其端点
</p>
<pre class="example" id="org65994ea">
这一属主关系是通过为每个 EndpointSlice 设置一个 属主 (owner) 引用，同时设置 kubernetes.io/service-name 标签来标明的，目的是方便查找隶属于某服务的所有 EndpointSlice
</pre>

<p>
控制面（尤其是端点切片的控制器） 会创建和管理 EndpointSlice 对象
</p>
<pre class="example" id="orgfa08a34">
EndpointSlice 对象还有一些其他使用场景， 例如作为服务网格 (Service Mesh) 的实现

这些场景都会导致有其他实体 或者控制器负责管理额外的 EndpointSlice 集合
</pre>

<p>
为了确保多个实体可以管理 EndpointSlice 而且不会相互产生干扰，Kubernetes 定义了标签 <span class="underline">endpointslice.kubernetes.io/managed-by</span> ，用来标明哪个实体在管理某个 EndpointSlice。端点切片控制器会在自己所管理的所有 EndpointSlice 上将该标签值设置 为 endpointslice-controller.k8s.io
</p>

<pre class="example" id="org08c2a4e">
管理 EndpointSlice 的其他实体也应该为此标签设置一个唯一值
</pre>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="ingress.html">Next: Ingress</a></td>
<td class="org-left"><a href="service.html">Previous: Service</a></td>
<td class="org-left"><a href="index.html">Home：服务发现和路由</a></td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="postamble" class="status">

		  <br/>
		  <div class='ds-thread'></div>
		  <script>
		  var duoshuoQuery = {short_name:'klose911'};
		  (function() {
					  var dsThread = document.getElementsByClassName('ds-thread')[0];
					  dsThread.setAttribute('data-thread-key', document.title);
					  dsThread.setAttribute('data-title', document.title);
					  dsThread.setAttribute('data-url', window.location.href);
					  var ds = document.createElement('script');
					  ds.type = 'text/javascript';ds.async = true;
					  ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
					  ds.charset = 'UTF-8';
					  (document.getElementsByTagName('head')[0] 
						|| document.getElementsByTagName('body')[0]).appendChild(ds);
					  })();
		  </script>
		  <script>
		  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
			(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
			m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
			})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
		  ga('create', 'UA-90850421-1', 'auto');
		  ga('send', 'pageview');
		  </script>
</div>
</body>
</html>
